#pragma once
#include <QString>
#include <QList>

struct Employee {
    QString name;
    QString position;
    QString zone;
    QString phone;
    QString email;
    QString note;

    static QList<Employee> mockData() {
        return {
                {"Іванов А.С.",     "Вантажник", "Секції: А, В", "09358167378", "ivanov@mail.ua",      "Відповідає за переміщення товарів на ділянках А та В складу."},
                {"Петренко А.П.",   "Керівник",  "Секція: А",    "09351362378", "petrenko@mail.ua",    "Відповідає за обіг працівників на ділянці складу."},
                {"Хромченко І.В.",  "Керівник",  "Секція: В",    "09904381283", "chromchenko@mail.ua", "Контролює зони зберігання секції В."},
                {"Василенко Н.К.",  "Вантажник", "Секції: В, С", "05094781734", "Vasilenko@mail.ua",   "Розвантаження та переміщення товарів у зонах В і С."},
                {"Тариков Х.Б.",    "Вантажник", "Секції: А, С", "09545819921", "Tarykow@mail.ua",     "Відповідає за стан інвентаризації у зонах А та С."},
                };
    }
};